gatling/resources/data/Soap_request_GetVenues.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.wizards.com/Service/2013-03">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:GetVenues>
         <ns:request>
            <ns:AuthToken>${access_token}</ns:AuthToken>
            <ns:MasterRuleCode>CAS</ns:MasterRuleCode>
            <ns:IsUpdate>false</ns:IsUpdate>
            <ns:OrganizationGuid>ffabef94-819e-4ffb-86f9-44e6ba117db1</ns:OrganizationGuid>
            <ns:SeasonCode>CAS</ns:SeasonCode>
         </ns:request>
      </ns:GetVenues>
   </soapenv:Body>
</soapenv:Envelope>